# # 算术运算符 : + - * / // % **
# print("10 + 4 = ", 10 + 4) # 加                   14
# print("10 - 4 = ", 10 - 4) # 减                   6
# print("10 * 4 = ", 10 * 4) # 乘                   40
# print("10 / 4 = ", 10 / 4) # 除                   2.5
# print("10 // 4 = ", 10 // 4) # 整除               2
# print("10 % 4 = ", 10 % 4)  # 取余或者求模         2
# print("10 ** 4 = ", 10 ** 4) # 幂指数 10的4次方    10000
#
# # 算术运算符的优先级   ---> ** --> *  /  //  %  +  -
# print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4 ** 2)


# # 案例: 输入两个数 x 和 y , 计算 x + y 以及 x - y 的结果并输出.
# x = int(input("请输入X的值:"))
# y = int(input("请输入Y的值:"))
#
# # 0.099999999999998 ---->精度损失 ; 由于计算机底层是基于 二进制 进行数据的存储与处理,二进制是无法准确的表示所有的小数,因此涉及到浮点数的运算,可能会损失精度
# print("x + y = ", x + y)
# print("x - y = ", x - y)




# ###########  赋值预算符 : = += -= *= /= //= %= **=
# num = 85
#
# num += 10 # num = num + 10
# print("num += 10 后, num = ", num)
#
# num -= 10
# print("num -= 10 后,num -= ",num)

#
# #######比较运算符 : ==  !=  >  >=  <  <=  ##########
# print("100 == 100 吗: ", 100 == 100)


# ########   逻辑运算符  : and  or   not  #########
# # 案例 1 : 键盘输入一个整数,判断这个整数是否在10-20之间   在:True   不在: False
# num = int(input("输入一个整数:"))
# print(f"{num}在10-20之间:" , num >=10 and num <=20)

# 案例 2 : 键盘输入一个整数,判断这个数字是否不在10-20之间
num = int(input("输入一个整数:"))
print(f"{num}不在10-20之间:", num < 10 or num >20)




