# if 条件判断,如果分数超过680,我就去清华读书.
# score = 600
# if score > 680:
#     print("欢迎你来清华读书")
#     print("也恭喜你即将进入精彩的大学生活")
# print("---------------------")


#
# 案例: 三角形类判断: 根据输入的三个边的边长(正整数),判定是等边三角形、等腰三角形、普通三角形，还是不能构成三角形
#      1.构成三角形的条件：两边之和大于第三边
#      2.三角形判定规则：
#             三个边相等：等边三角形
# #             两个边相等：等腰三角形
# #            三条边都不相等：普通三角形
#
# # 1. 接收输入的三角形三个边的边长
# a = int(input("请输入第一条边的边长:"))
# b = int(input("请输入第二条边的边长:"))
# c = int(input("请输入第三条边的边长:"))
#
# # 2. 判断三角形的类型  --pass是个空语句 ,起到一个语法占位的作用
# if a + b > c and a + c > b and b + c > a: #条件成立,构成三角形
#     if a == b and b == c:
#         print(f"{a} {b} {c} 这三个边长能构成等边三角形!!")
#     elif a == b or b == c or c == a:
#         print(f"{a} {b} {c} 这三个边长能构成等腰三角形!!")
#     else:
#         print(f"{a} {b} {c} 这三个边长能构成普通三角形!!")
# else:
#     print(f"{a} {b} {c} 这三个边长不能构成三角形!!")

#居民年度用电电费计算: 根据输入的用电度数,计算出电费
#   电费采用阶梯式计价方式,按照用户的消费的电量分段定价,用电价格随用电量增加呈阶梯式逐级递增的一种电价定价机制
#  阶梯电价规则:
#           第一档:2880度以下,电费单价0.4883元/度
#           第二档:2880-4800度,电费单价0.5383元/度
#           第三档:4800度以上,电费单价0.7883元/度

#  1.用户输入年度用电度数
num = float(input("请输入您的总用电数:"))
if num >= 2880:
    if num >= 2880 and num <= 4800:
        print(f"您的年度电费应是:", (num-2880) * 0.5383 + 2880 * 0.4883)
    else:
        print(f"您的年度电费应是:" , (num - 4800) * 0.7883 + (4800 - 2880) * 0.5383 + 2880 * 0.4883)
else:
    print(f"您的年度电费应是:",  num * 0.4883)
