# for循环:  遍历输入的字符串
#
# msg = input("请输入需要遍历的字符串:")
#
# for s in msg:  # s 表示遍历出来的元素;  msg 表示需要遍历的数据集
#     print(f"元素:{s}")
# else:
#     print("遍历结束")
#
#
# # 计算1-100之间所有奇数之和
# total = 0
# for i in range(1,101,2):
#     total += i
# print(f"1-100之间所有奇数之和:{total}")
#
#
# # 案例2: 计算100-500之间所有3的倍数的数字之和
# total = 0
#
# for i in range(100,501):
#     if i% 3 == 0:
#         total += i
# print(f"100-500之间所有3的倍数数字这和:{total}")



"""
   循环嵌套:  根据输入的长方形的长度: m 宽度: n,   打印一个长方形
     
     如下:  是一个长度为10,宽度为5的长方形
     * * * * * * * * * *
     * * * * * * * * * *
     * * * * * * * * * *
     * * * * * * * * * *
     * * * * * * * * * *
     
     print("*"): 语句自带换行效果,每次执行都会输出新的一行中
     print("*", end = " "): end表示的是每一次输出以什么结束; 默认 \n, 表示换行
"""
#  1. 接收键盘录入 m ,n
# 长度
m = int(input("请输入长方形的长度:"))

n = int(input("请输入长方形的宽度:"))

#  打印长方形
for j in range(n):
    for i in range(m):
        print("*",end = " ")
    print()
