#实现计算器功能 --->我没看答案自己写的
num = input("请输入您想要求和的两个数,第一个数为:")
num2 = input("第二个数为:")

print(f"两数相加的和为: {int(num) + int(num2)}")

#实现计算器功能 ----->讲义上的答案
num1 = int(input("请输入第一个数字: "))
num2 = int(input("请输入第二个数字: "))

print(f"{num1} + {num2} = {num1 + num2}")


# 算术运算符 : + - * / // % **
print("10 + 4 = ", 10 + 4) # 加                   14
print("10 - 4 = ", 10 - 4) # 减                   6
print("10 * 4 = ", 10 * 4) # 乘                   40
print("10 / 4 = ", 10 / 4) # 除                   2.5
print("10 // 4 = ", 10 // 4) # 整除               2
print("10 % 4 = ", 10 % 4)  # 取余或者求模         2
print("10 ** 4 = ", 10 ** 4) # 幂指数 10的4次方    10000

# 算术运算符的优先级   ---> ** --> *  /  //  %  +  -
print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4 ** 2)


# 案例: 输入两个数 x 和 y , 计算 x + y 以及 x - y 的结果并输出.
x = input()